
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		
		Организация       = ДанныеЗаполнения.Организация;
		Контрагент        = ДанныеЗаполнения.Клиент;
		Сотрудник         = ДанныеЗаполнения.Сотрудник;
		Комментарий       = СтрШаблон("Введен на основании: Предварительная запись №%1 от %2", ДанныеЗаполнения.Номер, Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy"));
		СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока            = Услуги.Добавить();
			НоваяСтрока.Услуга     = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Цена       = ТекСтрокаУслуги.Цена;
			НоваяСтрока.Сумма      = ТекСтрокаУслуги.Сумма;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Обозначаем регистры, по которым будет идти запись
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движения.Хозрасчётный.Записывать = Истина;
	
	Движения.ТоварыНаСкладах.Очистить();
	Движения.Продажи.Очистить();
	Движения.УчетЗатрат.Очистить();
	Движения.ЗаказыКлиентов.Очистить();
	Движения.Хозрасчётный.Очистить();
	
	Движения.ТоварыНаСкладах.Записать();
	
	// Устанавливаем Блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	Блокировка.Заблокировать();
	
	// Выбираем в запросе необходимые данные
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТовары.Ссылка.Склад КАК Склад,
	|	РеализацияТовары.Ссылка.Организация КАК Организация,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура,
	|	РеализацияТовары.Ссылка.Склад,
	|	РеализацияТовары.Ссылка.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	NULL,
	|	NULL,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Товары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТ_Товары.Количество КАК КоличествоВДокументе,
	|	ВТ_Товары.Сумма КАК СуммаВДокументе,
	|	ВТ_Товары.Склад КАК Склад,
	|	ВТ_Товары.Организация КАК Организация,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Товары.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Организация = &Организация
	|					И (Номенклатура, Склад) В
	|						(ВЫБРАТЬ
	|							ВТ_Товары.Номенклатура,
	|							ВТ_Товары.Склад
	|						ИЗ
	|							ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Товары.Склад = ТоварыНаСкладахОстатки.Склад
	|ИТОГИ ПО
	|	СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МоментВремени",  Новый Граница(МоментВремени()));
	
	// Начинаем обход результатов сначала по статье затрат
	ВыборкаСтатьяЗатрат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
		
		// Обнуляем сумму по статьям
		ОбщаяСтоимость = 0;
		
		// Внутри выборки по СтатьямЗатрат формируем детальную выборку
		ВыборкаДетальные = ВыборкаСтатьяЗатрат.Выбрать();
		
		Пока ВыборкаДетальные.Следующий() Цикл
			
			// Работаетм в выборке с Товаром
			Если ВыборкаДетальные.ЭтоТовар Тогда
				
				Превышение = ВыборкаДетальные.КоличествоВДокументе-ВыборкаДетальные.КоличествоОстаток;
				
				 Если Превышение > 0 Тогда
					
					// Запрещаем проведение и информируем пользователя
					Отказ = Истина;
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон("Превышение остатка по номенклатуре ""%1""  в количестве ""%2"" штук.",
						ВыборкаДетальные.НоменклатураПредставление, Превышение));
					Продолжить;
					
				КонецЕсли;
				
				Если ВыборкаДетальные.КоличествоОстаток > 0 Тогда
					СуммаСписания = (ВыборкаДетальные.КоличествоВДокументе*ВыборкаДетальные.СуммаОстаток) / ВыборкаДетальные.КоличествоОстаток;
				КонецЕсли;
				
				ОбщаяСтоимость = ОбщаяСтоимость + СуммаСписания;
				
				// Формируем движения по регистру ТоварыНаСкладах
				Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальные.Организация;
				Движение.Склад = ВыборкаДетальные.Склад;
				Движение.Номенклатура = ВыборкаДетальные.Номенклатура;
				Движение.Количество = ВыборкаДетальные.КоличествоВДокументе;
				Движение.Сумма = СуммаСписания;
				
				// Формируем движение по регистру Хозрасчетный (Списание товаров и материалов)
				Движение = Движения.Хозрасчётный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
				Движение.СчетКт = ВыборкаДетальные.СчетБухгалтерскогоУчета;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальные.Номенклатура;
				Движение.Период = Дата;
				Движение.Сумма = СуммаСписания;
				Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
				
			КонецЕсли;
			
			// Формируем движения по регистру Продажи
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Сотрудник = Сотрудник;
			Движение.Номенклатура = ВыборкаДетальные.Номенклатура;
			Движение.Количество = ВыборкаДетальные.КоличествоВДокументе;
			Движение.Сумма  = ВыборкаДетальные.СуммаВДокументе;
			
		КонецЦикла;
		
		Если ОбщаяСтоимость > 0 Тогда
			
			// Формируем движение по регистру УчетЗатрат
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СтатьяЗатрат = ВыборкаСтатьяЗатрат.СтатьяЗатрат;
			Движение.Сумма = ОбщаяСтоимость;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем движение по геристру Хозрасчетный (выручка от реализации)
	Движение = Движения.Хозрасчётный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	
	Если ЗначениеЗаполнено(ДокументОснование)Тогда
		
		//Формируем движение по регистру ЗаказыКлиентов
		Движение = Движения.ЗаказыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Клиент = Контрагент;
		Движение.ЗаказКлиента = ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

