
#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	// Получаем текущую строку табличной части
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	// Получаем цену номенклатуры через общий модуль
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	// Пересчитываем сумму после смены услуги
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	// Пересчитываем общую сумму документа после лююбых изменений в табличной части
	ПересчетСуммаДокумента();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеЦеныИлиКоличества(Услуги)
	
	// Получаем текущую строку табличной части
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	// Пересчитываем сумму в текущей строке (Количество * Цена)
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТЧ(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммаДокумента()
	
	ОбщаяСумма = Объект.Услуги.Итог("Сумма");
	
	Объект.СуммаДокумента = ОбщаяСумма;
	
КонецПроцедуры


#КонецОбласти
