&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьФормуКомандДополнительныхОтчетовИОбработок( 
		ПараметрКоманды, // Параметры обработчика команды
		ПараметрыВыполненияКоманды, // Параметры обработчика команды
		ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет(), // Возвращает вид: «ДополнительныйОтчет»
		ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы()); // Возвращает имя раздела: «РабочийСтол»
	
КонецПроцедуры