
#Область ОбработчикиСобытийФорм
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Получаем текущие данные в строке табличной части
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;

	// Получаем цену Номенклатуры через общий модуль
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	// Пересчитываем суммы после изменения номенклатуры
	ОбработатьИзменениеЦеныИлиКоличества("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	// Получаем текущие данные в строке табличной части
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;

	// Получаем цену услуги через общий модуль
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,,Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	
	
	// Пересчитываем суммы после изменения услуги
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	// Пересчитываем общую сумму документа после любых изменений в табличной части
	ПересчетСуммаДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	// Пересчитываем общую сумму документа после любых изменений в табличной части
	ПересчетСуммаДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеЦеныИлиКоличества(ИмяТабличнойЧасти)
	
	// Получаем текущую строку табличной части по её имени
	СтрокаТЧ = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	// Пересчитываем сумму в текущей строке (Количество * Цена)
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТЧ(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммаДокумента()
	
	ОбщаяСумма = Объект.Товары.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
	Объект.СуммаДокумента = ОбщаяСумма;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ОбновитьВидимостьНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьВидимостьНаСервере()
	
	// Получаем тип контрагента через функцию БСП
	Значение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ТипКонтрагента");
	ТипКонтрагента = Значение.ТипКонтрагента;
	
	// Управляем видимостью
	Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Договор.Видимость = Ложь;
	Иначе
		Элементы.Договор.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


