
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Получаем тип контрагента
	ТипОрганизации = ЭтотОбъект.ТипОрганизации;
	
	// Определяем обусловленную длинну ИНН для типов организации
	ДлинаИНН = 0;
	
	Если ТипОрганизации = Перечисления.ТипыОрганизаций.ИндивидуальныйПредприниматель Тогда
		ДлинаИНН = 12;
	ИначеЕсли ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо Тогда
		ДлинаИНН = 10;
	КонецЕсли;
	
	// Проверяем реквизит на соответствие
	Если ДлинаИНН > 0 Тогда
		ТекущаяДлина = СтрДлина(СокрЛП(ЭтотОбъект.ИНН));
		
		Если ТекущаяДлина <> ДлинаИНН Тогда
			// Добавляем ошибку в список проверяемых реквизитов
			ОбщегоНазначения.СообщитьПользователю(
				"Длина ИНН для даного типа организации должна составлять " + ДлинаИНН + " знаков.",
				ЭтотОбъект, "ИНН",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
