
#Область ОбработчикиСобытийФорм

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	ДатаФормат = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
	
	Объект.Наименование = "№ " + Объект.Номер + " от " + ДатаФормат + " г.";
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ДоговорБессрочный = (Объект.Бессрочный = Истина);
	
	Элементы.ДатаОкончания.Видимость = Не ДоговорБессрочный;
	
КонецПроцедуры

#КонецОбласти

