
#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ОбработатьИзменениеЦеныИлиКоличества("Услуги");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)

	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	ЗаполнитьСтатьюЗатрат(СтрокаТЧ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеЦеныИлиКоличества(ИмяТабличнойЧасти)
	
	// Получаем текущую строку табличной части по её имени
	СтрокаТЧ = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	// Пересчитываем сумму в текущей строке (Количество * Цена)
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТЧ(СтрокаТЧ);
	
	// Пересчитываем общую сумму документа
	ПересчетСуммаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммаДокумента()
	
	ОбщаяСумма = Объект.Товары.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
	Объект.СуммаДокумента = ОбщаяСумма;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатьюЗатрат(СтрокаТЧ)
	
	// Проверяем, что номенклатура выбрана
	Если СтрокаТЧ.Услуга = Неопределено Тогда
		СтрокаТЧ.СтатьяЗатрат = Неопределено;
		Возврат;
	КонецЕсли;
	
	// Получаем данные номенклатуры на сервере
	СтатьяЗатрат = ПолучитьДанныеНоменклатурыНаСервере(СтрокаТЧ.Услуга);
	
	// Присваиваем результат
	СтрокаТЧ.СтатьяЗатрат = СтатьяЗатрат;
	

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНоменклатурыНаСервере(Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатьяЗатрат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

