
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаполнитьДвиженияПоТоварам();
	ЗаполнитьДвиженияПоУслугам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДвиженияПоТоварам()
	
	// Указываем регистры для записи
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Хозрасчётный.Записывать = Истина;
	
	// Формируем запрос для получения данных для регистра
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеТовары.Количество) КАК Количество,
	|	СУММА(ПоступлениеТовары.Сумма) КАК СуммаТовары,
	|	ПоступлениеТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТовары
	|ГДЕ
	|	ПоступлениеТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТовары.Номенклатура,
	|	ПоступлениеТовары.Номенклатура.СчетБухгалтерскогоУчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		// Товары на складах
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.СуммаТовары;
		
		// Хозрасчетный
		Движение = Движения.Хозрасчётный.Добавить();
		Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.СуммаТовары;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Контрагент;
		
	КонецЦикла
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияПоУслугам()
	
	// Указываем регистры для записи
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчётный.Записывать = Истина;
	
	// Формируем запрос для получения данных для регистра
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ПоступлениеУслуги.Сумма) КАК СуммаУслуги,
	|	ПоступлениеУслуги.Услуга.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеУслуги
	|ГДЕ
	|	ПоступлениеУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеУслуги.СтатьяЗатрат,
	|	ПоступлениеУслуги.Услуга.СчетБухгалтерскогоУчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		// Учет затрат
		Движение = Движения.УчетЗатрат.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтатьяЗатрат = Выборка.СтатьяЗатрат;
		Движение.Сумма = Выборка.СуммаУслуги;
		
		// Хозрасчетный
		Движение = Движения.Хозрасчётный.Добавить();
		Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.СуммаУслуги;
		Движение.Содержание = "Отражено поступление услуг от поставщика";
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Выборка.СтатьяЗатрат);
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
